In [42]:
import os

import numpy as np
import pandas as pd

In [43]:
from kaggle.api.kaggle_api_extended import KaggleApi
api = KaggleApi()
api.authenticate()

In [44]:
api.dataset_download_file('raosuny/e-commerce-purchase-dataset',
                          file_name='purchase_data_exe.csv',
                          path='./datasets')

True

In [45]:
import zipfile

with zipfile.ZipFile('./datasets/purchase_data_exe.csv.zip', 'r') as zipref:
    zipref.extractall('./datasets/')

In [46]:
zip_folder = './datasets/purchase_data_exe.csv.zip'
if(os.path.exists(zip_folder) and os.path.isfile(zip_folder)):
  os.remove(zip_folder)
  print("deleted")
else:
  print("not found")

deleted

In [47]:
transaction_df= pd.read_csv("./datasets/purchase_data_exe.csv")
transaction_df.head()

,date,customer_id,product_category,payment_method,value [USD],time_on_site [Minutes],clicks_in_site,Unnamed: 7
0,20/11/2018,37077,505,credit,49.53,12.0,8,NaN
1,20/11/2018,59173,509,paypal,50.61,25.9,8,NaN
2,20/11/2018,41066,507,credit,85.99,34.9,11,NaN
3,20/11/2018,50741,506,credit,34.60,16.5,9,NaN
4,20/11/2018,53639,515,paypal,266.27,43.1,30,NaN

In [48]:
modified_df=transaction_df[['customer_id','product_category']]

In [49]:
modified_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24999 entries, 0 to 24998
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       24999 non-null  int64
 1   product_category  24999 non-null  int64
dtypes: int64(2)
memory usage: 390.7 KB

In [68]:
grouped = modified_df.groupby('customer_id')['product_category'].apply(lambda x: ','.join(map(str, x))).reset_index()

grouped.head()

   customer_id product_category
0        10000          507,503
1        10002              515
2        10004              511
3        10006          512,502
4        10013              501

In [69]:
grouped=grouped.drop(['customer_id'],axis=1)

In [70]:
grouped=grouped['product_category'].str.split(',',expand=True)

In [71]:
grouped.head()

     0     1     2     3     4
0  507   503  None  None  None
1  515  None  None  None  None
2  511  None  None  None  None
3  512   502  None  None  None
4  501  None  None  None  None

In [72]:
item_to_cat = {
    '501': "jackets",
    '502': "caps",
    '503': "goggles",
    '504': "gloves",
    '505': "boots",
    '506':"tents",
    '507':"hiking gear",
    '508':"snow gear",
    '509':"water",
    '510':"trackpants",
    '511':"gatorade",
    '512':"heater",
    '513':"pullover",
    '514':"torch",
    '515':"blanket"
}

In [73]:
grouped.iloc[0][3]==None

True

In [74]:
for col in range(grouped.shape[1]):
    for row in range(grouped.shape[0]):
        value = grouped.iloc[row][col]
        if  value!= None:
            grouped.iloc[row][col] = item_to_cat[value]

In [32]:
grouped.to_csv('./Cleaned Dataset/transaction_data_arm.csv',index=False)